# Python for data science 
Python is an extremly useful and powerful programming langauge, which allowed it to become one of the most used and in demand langauges used by developers. One of the main reasons for this is the library packagaes that can be added onto python allowing for easy data analysis. As well as the langauge being easy to understand and easy to learn.

For a lot of data manipulation and analysis the main modules that are needed are the pandas and numpy libraries. In this notebook the pandas library will be used to import the data and manipulte the data. Due to the size of the library it means that there are lots of different methods and functions that can be used, this notebook will only look at some. To look at more methods or get further information about functions we will look at in this document, please look at the documentation for the library: https://pandas.pydata.org/docs/user_guide/index.html

In [1]:
#The module is imported and given the alias pd 
import pandas as pd 

#If you want to run all code locally then uncomment this line and make sure the data is in the correct place
#data = pd.read_csv('Data/titanic.csv')

#CSV file data is read into file and stored in the variable data
#This is being pulled from an online github - so can only be run when connected to internet
data = pd.read_csv('https://raw.githubusercontent.com/chroadhouse/Futureme/main/Data/titanic.csv')

# Inital look at the data 
When importing the data it's good to do some inital analysis of the data to familiarse yourself with the data set 

* .head() - shows gives you a small amount of the data

* .columns - gives you the names of the columns of the tabes 

* .describe() - displays data about the quantitative data such as the mean, max, count and minimum (but these values are not stored)

* .info() - gives you a run down of the data set

* .dtypes() - gives you the dfferent data types for the column names 

* .shape - gives you the shape of the database in terms of rows and columns

In [2]:
#This is usually run to ensure that the data set has imported correctly into the file
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
#If you do not understand some of these data types please look at the into_to_python file 
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
data.shape

(891, 12)

# Creating our own table with meterics being run on data
Even though you can run the .describe() function that returns a table with all the meteric data you would want, it is still useful to be able to do this ourselves

We can single out one coumn of data by calling our variable the data is stored in and putting [] next to it with the name of the column we want to isolate inside

In [8]:
#data['age'] will only return the rows for the age column 

age_mean = data['Age'].mean()
age_mode = data['Age'].mode()
age_median = data['Age'].median()
age_max = data['Age'].max()
age_min = data['Age'].min()
age_stand = data['Age'].std()

#Here we create a dictionary with the key being the title of the column and the value being the variables we created above
age_table = pd.DataFrame({
    'Mean':age_mean,
    'Mode':age_mode,
    'Median':age_median,
    'Maximum':age_max,
    'Minumum':age_min,
    'Standard Deviation':age_stand
})

age_table

        Mean  Mode  Median  Maximum  Minumum  Standard Deviation
0  29.699118  24.0    28.0     80.0     0.42           14.526497

In [9]:
fare_mean = data['Fare'].mean()
fare_mode = data['Fare'].mode()
fare_median = data['Fare'].median()
fare_max = data['Fare'].max()
fare_min = data['Fare'].min()
fare_stand = data['Fare'].std()


age_table = pd.DataFrame({
    'Mean':fare_mean,
    'Mode':fare_mode,
    'Median':fare_median,
    'Maximum':fare_max,
    'Minumum':fare_min,
    'Standard Deviation':fare_stand
})

age_table

        Mean  Mode   Median   Maximum  Minumum  Standard Deviation
0  32.204208  8.05  14.4542  512.3292      0.0           49.693429

# Checking the frequency of categorical data
Data analysis means you have to look at more than just he numerical data. One of the best things you can do when looking at data such as categorical data is looking at the frequency of each of the values

In [10]:
embark_data = data['Embarked'].value_counts()

embark_data

S    644
C    168
Q     77
Name: Embarked, dtype: int64